Revit 2027 API
WorksharingTooltipInfo.Creator Property
 The user name of the user who created the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Creator { get; }
Public ReadOnly Property Creator As String
	Get
public:
property String^ Creator {
	String^ get ();
}
member Creator : string with get
Property Value
String
See Also
Reference
WorksharingTooltipInfo Class
Autodesk.Revit.DB Namespace